In [38]:
import numpy as np 
import pandas as pd

In [39]:
df=pd.read_csv("Job Market Sri Lanka.csv")
df.head()

,year,month,job_title,industry,experience_level,salary_min_gbp,salary_max_gbp,salary_median_gbp,number_of_openings,demand_index,...,job_type,skills_required,job_title_encoded,industry_encoded,city_encoded,region_encoded,education_requirement_encoded,job_type_encoded,skills_required_encoded,hiring_trend_encoded
0,2025,2,Pharmacist,Retail,Senior,4819,7033,6224,8,58,...,Temporary,Customer Service,7,9,10,8,4,4,366,2
1,2025,5,Teacher,Telecoms,Senior,8223,14740,12703,6,38,...,Internship,"Accounting, SQL",11,10,10,6,1,2,111,2
2,2025,8,Sales Executive,Telecoms,Senior,10394,20832,13701,2,41,...,Part-time,"Accounting, Python, Project Management",9,10,9,7,2,3,109,2
3,2025,9,Sales Executive,Logistics,Entry,1795,4620,2814,5,26,...,Part-time,"Clinical Care, Communication, Accounting",9,7,11,2,0,3,135,0
4,2025,8,Sales Executive,Finance,Senior,14273,20999,18720,3,56,...,Temporary,"Data Analysis, Clinical Care, Excel",9,3,7,0,1,4,504,2

In [40]:
df.shape

(30000, 24)

In [41]:
df.isnull().sum()

year                             0
month                            0
job_title                        0
industry                         0
experience_level                 0
salary_min_gbp                   0
salary_max_gbp                   0
salary_median_gbp                0
number_of_openings               0
demand_index                     0
hiring_trend                     0
city                             0
region                           0
education_requirement            0
job_type                         0
skills_required                  0
job_title_encoded                0
industry_encoded                 0
city_encoded                     0
region_encoded                   0
education_requirement_encoded    0
job_type_encoded                 0
skills_required_encoded          0
hiring_trend_encoded             0
dtype: int64

In [55]:
df.dtypes

year                              int64
month                             int64
job_title                        object
industry                         object
experience_level                 object
salary_min_gbp                    int64
salary_max_gbp                    int64
salary_median_gbp                 int64
number_of_openings                int64
demand_index                      int64
hiring_trend                     object
city                             object
region                           object
education_requirement            object
job_type                         object
skills_required                  object
job_title_encoded                 int64
industry_encoded                  int64
city_encoded                      int64
region_encoded                    int64
education_requirement_encoded     int64
job_type_encoded                  int64
skills_required_encoded           int64
hiring_trend_encoded              int64
dtype: object

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 24 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   year                           30000 non-null  int64
 1   month                          30000 non-null  int64
 2   job_title                      30000 non-null  object
 3   industry                       30000 non-null  object
 4   experience_level               30000 non-null  object
 5   salary_min_gbp                 30000 non-null  int64
 6   salary_max_gbp                 30000 non-null  int64
 7   salary_median_gbp              30000 non-null  int64
 8   number_of_openings             30000 non-null  int64
 9   demand_index                   30000 non-null  int64
 10  hiring_trend                   30000 non-null  object
 11  city                           30000 non-null  object
 12  region                         30000 non-null  object
 13  education_requirement          30000 non-null  object
 14  job_type                       30000 non-null  object
 15  skills_required                30000 non-null  object
 16  job_title_encoded              30000 non-null  int64
 17  industry_encoded               30000 non-null  int64
 18  city_encoded                   30000 non-null  int64
 19  region_encoded                 30000 non-null  int64
 20  education_requirement_encoded  30000 non-null  int64
 21  job_type_encoded               30000 non-null  int64
 22  skills_required_encoded        30000 non-null  int64
 23  hiring_trend_encoded           30000 non-null  int64
dtypes: int64(15), object(9)
memory usage: 5.5+ MB

In [43]:
df.head(2)

,year,month,job_title,industry,experience_level,salary_min_gbp,salary_max_gbp,salary_median_gbp,number_of_openings,demand_index,...,job_type,skills_required,job_title_encoded,industry_encoded,city_encoded,region_encoded,education_requirement_encoded,job_type_encoded,skills_required_encoded,hiring_trend_encoded
0,2025,2,Pharmacist,Retail,Senior,4819,7033,6224,8,58,...,Temporary,Customer Service,7,9,10,8,4,4,366,2
1,2025,5,Teacher,Telecoms,Senior,8223,14740,12703,6,38,...,Internship,"Accounting, SQL",11,10,10,6,1,2,111,2

In [ ]:

df.corr(numeric_only=True)['salary_median_gbp']

year                              int64
month                             int64
job_title                        object
industry                         object
experience_level                 object
salary_min_gbp                    int64
salary_max_gbp                    int64
salary_median_gbp                 int64
number_of_openings                int64
demand_index                      int64
hiring_trend                     object
city                             object
region                           object
education_requirement            object
job_type                         object
skills_required                  object
job_title_encoded                 int64
industry_encoded                  int64
city_encoded                      int64
region_encoded                    int64
education_requirement_encoded     int64
job_type_encoded                  int64
skills_required_encoded           int64
hiring_trend_encoded              int64
dtype: object

In [50]:
select=['job_title','experience_level','industry','city','salary_median_gbp']
data=df[select]
data=data.dropna()
data=data.drop_duplicates()
data.shape

(27822, 5)